
-----------------------------------------------------------------------------
沁漣宮地圖   (第一階總覽圖)
-----------------------------------------------------------------------------
  水源  -- 荷花池-----------荷花池-----------荷花池        **************
    \     /                   |                    \  ---  **仙人掌之家**
     \   /           沁心亭 **********              \    / ************** 
    荷花池 --------- **    花  園   ** ---------   荷花池 
       \           / *****************                /
        \   九  曲  回  廊---「」---九  曲  回  廊   /     
         \       /            |            |   \    /
          \     /           書房          琴室  \  /      
      **********                           |     \/
      ** 跨院 **  ------- 沁漣宮正廳---九曲回廊-水榭
      **********              |
                              |
       青草地 -----------  門  口  ------------ 楓林
                              ↓
                          天山山巒
                          
---------------------------------------------------------------------------------
注 :   整體定位 : 古香古色, 化外仙境,  
                  有詩為讚: 此境只應天上有, 人間哪得幾回聞 ?  
 
       1.  荷花池和花園的景觀隨四時變化而變, 花叢中和假山,小橋等地方可以 go  進去.
           但是並不做為花園的出口,應該是設計成同一個room 中的位移變化 的感覺. , 
           在花園中的任何地方說話, 同在花園中的人都可以聽見.
       2.  荷花池裡有 畫舫 . (一種遊船) , 可以上去,劃著它在池中遊玩.
       3.  如果在從 正廳  到跨院的月亮門外向 跨院 看,只能看到屏風, 看不到院 內的
           景物. 除了我們兩個, 用GOTO也不能進跨院.
       4.  跨院 內的格局,你來規劃吧,  (不要放電腦等,有現代特徵的 東西,OK ?)
       5.  其它因工作須要和為走路方便的出口,全部連在" 門口 " 這個room 中

lean xrz 

snowlf
