// CODE BY SCATTER
// V. 1.0
// describing BY SNOWLF

#include <ansi.h>

inherit ROOM;

void create()

{
        set("short", HIC"╢РлЗйр©"NOR);
        set("long", @LONG
уБйгр╩╪Д╨эфум╗╣д╢РлЗйрё╛╤╚цФспих╢╟ё╛╢╟об╡╩т╤ё╛©©до╠ъг╫╣д╣ь╥╫сп╦Ж╢Р
лЗл╗ё╛сп╩Пб╞(stove)╨м╥ГоДё╛г╫╫г╩╧спр╩╢коДвс(box)ё╛оК╠ьйгв╟т╜╡дао╩Рд╬л©
╪╟╧╓╬ъж╝юЮсц╣д╟и║ё
LONG
        );

	set("exits", ([
                "north" : "/newjob/tiejiang/datiechang.c"
				]));
        set("item_desc", ([
                        "stove": "дЦцЧцЧб╞╠ъё╛╩╧спсЮнбё╛оК╠ьйгг╟╡╩╠ь╩╧спхктзуБюОсц╧ЩкЭ╢Ржф╤╚нВдьё║\n",
                        "box": "дЦйгю╢╢РлЗ╣дбПё©урур©╢оДвсюОспц╩спдЦсц╣дио╣д╤╚нВ╟и║ё\n",
                        "╩Пб╞": "дЦцЧцЧб╞╠ъё╛╩╧спсЮнбё╛оК╠ьйгг╟╡╩╠ь╩╧спхктзуБюОсц╧ЩкЭ╢Ржф╤╚нВдьё║\n",
                        "оДвс": "дЦйгю╢╢РлЗ╣дбПё©урур©╢оДвсюОспц╩спдЦсц╣дио╣д╤╚нВ╟и║ё\n",
                        ]));     


		set("objects",([
                "/newjob/tiejiang/obj/datietai.c": 1,
		]));


        setup();
}

