// random_name.c Ëæ»úÐÕÃû¿â¡£
//°æÈ¨Îª¡¼ÉñÖÝ¡½Î×Ê¦¹«»á¸ß¼¶Î×Ê¦ËùÓÐ¡£

nosave mixed xing = ({
({"ÕÔ","zhao"}),({"Ç®","qian"}),({"Ëï","sun"}),({"Àî","li"}),({"ÖÜ","zhou"}),({"Îâ","wu"}),({"Ö£","zhen"}),({"Íõ","wang"}),
({"·ë","feng"}),({"³Â","chen"}),({"ñÒ","zhu"}),({"ÎÀ","wei"}),({"½¯","jiang"}),({"Éò","shen"}),({"º«","han"}),({"Ñî","yang"}),
({"Öì","zhu"}),({"ÇØ","qing"}),({"ÓÈ","you"}),({"Ðí","xu"}),({"ºÎ","he"}),({"ÂÀ","lv"}),({"Ê©","shi"}),({"ÕÅ","zhang"}),
({"¿×","kong"}),({"²Ü","cao"}),({"ÑÏ","yan"}),({"»ª","hua"}),({"½ð","jin"}),({"Îº","wei"}),({"ÌÕ","tao"}),({"½ª","jiang"}),
({"ÆÝ","qie"}),({"Ð»","xie"}),({"×Þ","zou"}),({"Ó÷","yu"}),({"°Ø","bo"}),({"Ë®","shui"}),({"ñ¼","dou"}),({"ÕÂ","zhang"}),
({"ÔÆ","yun"}),({"ËÕ","su"}),({"ÅË","pan"}),({"¸ð","ge"}),({"¶Î","duan"}),({"·¶","fan"}),({"Åí","peng"}),({"Â³","lu"}),
({"Î¤","wei"}),({"²ý","chang"}),({"Âí","ma"}),({"Ãç","miao"}),({"·ï","feng"}),({"»¨","hua"}),({"·½","fang"}),({"ÈÎ","ren"}),
({"Ô¬","yuan"}),({"Áø","liu"}),({"µË","deng"}),({"±«","bao"}),({"Ê·","shi"}),({"ÌÆ","tang"}),({"·Ñ","fei"}),({"Á®","lian"}),
({"á¯","chen"}),({"Ñ¦","xue"}),({"À×","lei"}),({"ºØ","he"}),({"Äß","ni"}),({"ÌÀ","tang"}),({"ÌÙ","teng"}),({"Òó","yin"}),
({"ÂÞ","luo"}),({"»ª","hua"}),({"ºÂ","hao"}),({"Ìï","tian"}),({"°²","an"}),({"³£","chang"}),({"ÀÕ","jin"}),({"Ê±","shi"}),
({"¸¶","fu"}),({"Æ¤","pi"}),({"±å","bian"}),({"Æë","qi"}),({"¿µ","kang"}),({"Îé","wu"}),({"Óà","yu"}),({"Ôª","yuan"}),
({"¹Ë","gu"}),({"Æ½","ping"}),({"»Æ","huang"}),({"ºÍ","he"}),({"ÄÂ","mu"}),({"Ð¤","xiao"}),({"Òü","yin"}),({"Ò¦","yao"}),
({"ÉÛ","shao"}),({"Õ¿","zhan"}),({"Íô","wang"}),({"Æî","qi"}),({"Ã«","mao"}),({"Óí","yu"}),({"µÒ","di"}),({"Ã×","mi"}),
({"±´","bei"}),({"Ã÷","ming"}),({"²Ø","zang"}),({"¼Æ","ji"}),({"¼§","ji"}),({"³É","cheng"}),({"´÷","dai"}),({"Ì·","tan"}),
({"ËÎ","song"}),({"Ã©","mao"}),({"ÅÓ","pang"}),({"ÐÜ","xiong"}),({"¼Í","ji"}),({"Êæ","su"}),({"Çü","qu"}),({"Ïî","xiang"}),
({"×£","zhu"}),({"¶­","dong"}),({"Áº","liang"}),({"·®","fan"}),({"ºú","hu"}),({"Áè","ling"}),({"»ô","ho"}),({"ÓÝ","yu"}),
({"Íò","wan"}),({"¿Â","ke"}),({"¹Ü","guan"}),({"Â¬","lu"}),({"Ó¢","ying"}),({"³ð","qiu"}),({"îî","hou"}),({"ÔÀ","yue"}),
({"Ë§","shuai"}),({"Äê","nian"}),({"Ù¡","dong"}),({"Øá","kuai"}),({"ÖÓ","zhong"}),({"×Ú","zong"}),({"ÁÖ","lin"}),({"Ê¯","shi"}),
({"Ë¾Âí","sima"}),({"ÉÏ¹Ù","shangguan"}),({"Å·Ñô","ouyang"}),({"ÏÄºî","xiahou"}),({"Öî¸ð","zhuge"}),({"¶«·½","dongfang"}),
({"ÄÏ¹¬","nangong"}),({"ºôÑÓ","huyan"}),({"»Ê¸¦","huangpu"}),({"¹«Ëï","gongsun"}),({"Áîºü","linghu"}),({"ÓîÎÄ","yuwen"}),
({"³¤Ëï","zhangsun"}),({"Ä»ÈÝ","murong"}),({"Ë¾Í½","situ"}),({"Î÷ÃÅ","ximen"}),({"Óá","yu"}),({"Äª","mo"}),
});

nosave mixed name = ({
({"ÖÒ","zhong"}),({"Ð¢","xiao"}),({"Àñ","li"}),({"Òå","yi"}),({"ÖÇ","zhi"}),({"ÓÂ","yong"}),({"ÈÊ","ren"}),({"¿ï","kuang"}),
({"ÏÜ","xian"}),({"Áî","ling"}),({"¸£","fu"}),({"Â»","lu"}),({"´ó","da"}),({"Ð¡","xiao"}),({"Ïþ","xiao"}),({"¸ß","gao"}),
({"¿É","ke"}),({"°¢","a"}),({"½ð","jin"}),({"ÊÀ","shi"}),({"¿Ë","ke"}),({"Êå","shu"}),({"Ö®","zhi"}),({"¹«","gong"}),
({"·ò","fu"}),({"Ê±","shi"}),({"Èô","ruo"}),({"Çì","qing"}),({"ÎÄ","wen"}),({"Îä","wu"}),({"¶à","duo"}),({"²Å","cai"}),
({"³¤","chang"}),({"×Ó","zi"}),({"ÓÀ","yong"}),({"ÓÑ","you"}),({"ÈË","ren"}),({"Îª","wei"}),({"Ìú","tie"}),({"²»","bu"}),
({"Ö¾","zhi"}),({"Ã÷","ming"}),({"ÀÖ","le"}),({"Ú¤","ming"}),({"ÎÞ","wu"}),({"Áæ","ling"}),({"¸»","fu"}),({"²®","bo"}),
({"µÀ","dao"}),({"Ðþ","xuan"}),({"ÉÙ","shao"}),({"º×","he"}),({"Çà",""}),({"´ä","cui"}),({"Ô¶","yuan"}),({"µ¤","dan"}),
({"µÂ","de"}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),
});

nosave mixed name_e = ({
({"°Ô","ba"}),({"°×","bai"}),({"°à","ban"}),({"±ó","bin"}),({"±ö","bin"}),({"²ý","chang"}),({"³¬","chao"}),({"³Ï","chen"}),
({"´¨","chuan"}),({"¶¦","ding"}),({"¶¨","ding"}),({"·¨","fa"}),({"·É","fei"}),({"·ç","feng"}),({"·æ","feng"}),({"¸Ö","gang"}),
({"î¸","gang"}),({"¹á","guan"}),({"¹â","guang"}),({"º£","hai"}),({"»¢","hu"}),({"»ª","hua"}),({"ºÆ","hao"}),({"ºê","hong"}),
({"¼Ã","ji"}),({"¼á","jian"}),({"½¡","jian"}),({"½£","jian"}),({"½­","jiang"}),({"½ø","jin"}),({"½Ü","jie"}),({"¿¡","jun"}),
({"¿µ","kang"}),({"Á¼","liang"}),({"÷ë","lin"}),({"Ãñ","min"}),({"Ã÷","ming"}),({"Ãù","ming"}),({"Äþ","ning"}),({"Åà","pei"}),
({"Æô","qi"}),({"Ç¿","qiang"}),({"ÈÙ","rong"}),({"É½","shan"}),({"Ì©","tai"}),({"ÌÎ","tao"}),({"Í¦","ting"}),({"Î°","wei"}),
({"Îõ","xi"}),({"Ïé","xiang"}),({"ÐÛ","xiong"}),({"Ðñ","xu"}),({"Èº","qun"}),({"Ñï","yang"}),({"Çå","qing"}),({"Òã","yi"}),
({"è¤","yu"}),({"Óð","yu"}),({"Óî","yu"}),({"ÖÛ","zhou"}),({"¶·","dou"}),({"Õæ","zhen"}),({"·á","feng"}),({"·ã","feng"}),
({"Æ½","ping"}),({"³å","chong"}),({"Ö®","zhi"}),({"·½","fang"}),({"éª","nan"}),({"°²","an"}),({"À×","lei"}),({"Äþ","ning"}),
({"¶À","du"}),({"²¨","po"}),({"ÀË","lang"}),({"´¾","chun"}),({"·â","feng"}),({"ÔÆ","yun"}),({"Ìì","tian"}),({"¹ó","gui"}),
({"çù","qi"}),({"Ôó","ze"}),({"Àû","li"}),({"ÐË","xing"}),({"Ö¹","zhi"}),({"Ãð","mie"}),({"·å","feng"}),({"¿Õ","kong"}),
({"ÖÐ","zhong"}),({"Ñ«","xun"}),({"åÓ","kui"}),({"Ô½","yue"}),({"Óþ","yu"}),({"Òå","yi"}),({"Ê¤","sheng"}),({"ºë","hong"}),
({"½ø","jin"}),({"Ë³","shun"}),({"Çà","qing"}),({"¿¡","jun"}),({"ÐÅ","xin"}),({"ÌÏ","tao"}),({"¶¨","ding"}),({"Õý","zheng"}),
({"Ðã","xiu"}),({"ÉÜ","shao"}),({"Á¢","li"}),({"¹ç","gui"}),({"Í¢","ting"}),({"Õñ","zhen"}),({"Ðû","xuan"}),({"ÈÃ","rang"}),
({"Åô","peng"}),({"Ê¢","sheng"}),({"Èð","rui"}),({"¼á","jian"}),({"Íþ","wei"}),({"´ï","da"}),({"Íú","wang"}),({"ÖÒ","zhong"}),
({"ÓÂ","yong"}),({"Çì","qing"}),({"Èó","run"}),({"Í¨","tong"}),({"ÃÍ","meng"}),({"Â¡","long"}),({"ÐÂ","xin"}),({"ËÉ","song"}),
({"ÁÁ","liang"}),({"¶÷","en"}),({"Ç¨","qian"}),({"µñ","diao"}),({"±£","bao"}),({"±ª","bao"}),({"Ê¥","sheng"}),({"Áú","long"}),
({"ÓÓ","you"}),({"Í¤","ting"}),({"á·","dai"}),({"ÑÒ","yan"}),({"Åµ","nuo"}),({"¹È","gu"}),({"¸ß","gao"}),({"ºã","heng"}),
({"¹é","gui"}),({"³¼","chen"}),({"¾¶","jin"}),({"êÊ","ye"}),({"ôÞ","hen"}),({"æè","hua"}),({"Èª","quan"}),({"Áø","liu"}),
({"îÚ","yu"}),({"ÏÔ","xian"}),({"½÷","jin"}),({"Òæ","yi"}),({"Ì¹","tan"}),({"·²","fan"}),({"¾´","jing"}),({"Ðù","xuan"}),
({"±þ","bing"}),({"Ñ©","xue"}),({"¼É","ji"}),({"¾¸","jing"}),
});

nosave mixed name_w = ({      //Å®ÐÔ×¨ÓÃ
({"°®","ai"}),({"´º","chun"}),({"µ¤","dan"}),({"·¼","fang"}),({"·Ò","fen"}),({"·ï","feng"}),({"¹Ã","gu"}),({"ºì","hong"}),
({"ºç","hong"}),({"½¿","jiao"}),({"¾ê","juan"}),({"¾Õ","ju"}),({"À¼","lan"}),({"á°","lan"}),({"Àö","li"}),({"Àò","li"}),
({"Á«","lian"}),({"Áá","ling"}),({"ÁÕ","lin"}),({"ÄÈ","na"}),({"ÇÙ","qin"}),({"ÇÛ","qin"}),({"Ù»","qian"}),({"Æ¼","ping"}),
({"æÃ","ting"}),({"Ï¼","xia"}),({"Ïã","xaing"}),({"ÑÞ","yan"}),({"Ñà","yan"}),({"Ó¢","ying"}),({"çø","ying"}),({"Óñ","yu"}),
({"Õä","zhen"}),({"Öé","zhu"}),({"æÂ","yuan"}),({"½õ","jin"}),({"Ü¿","yun"}),({"Áé","ling"}),({"Éº","shan"}),({"Ü½","fu"}),
({"æµ","xian"}),({"èª","jin"}),({"¬Ž","yao"}),({"Ïå","xiang"}),({"ÈØ","rong"}),({"Èô","ruo"}),({"ÃÎ","meng"}),({"ÒÇ","yi"}),
({"",""}),
});

void set_random_name(string gender)
{
	string l_c, l_e, f_c, f_e, f_c_e, f_e_e;
	int    i, j, k;

	i = random(sizeof(xing));
	if (stringp(gender) && gender == "Å®ÐÔ"){
		j = random(sizeof(name_w));
		k = random(sizeof(name_w));
		if ( k == j ) k = random(sizeof(name_w)) / 2;
		f_c = name_w[j][0];
		f_e = name_w[j][1];
		f_c_e = name_w[k][0];
		f_e_e = name_w[k][1];
	}else{
		j = random(sizeof(name));
		k = random(sizeof(name_e));
		f_c = name[j][0];
		f_e = name[j][1];
		f_c_e = name_e[k][0];
		f_e_e = name_e[k][1];
	}

	l_c = xing[i][0];
	l_e = xing[i][1];

	set_name(l_c+f_c+f_c_e, ({ l_e+ " " + f_e + f_e_e , l_e, }));
	set("id_long", l_e + " " + f_e + f_e_e);
	set("id_short", l_e);
}
